


import 'package:flutter/material.dart';

class DetailPage extends StatelessWidget {





  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("Detail"),
      ),

      body: Padding(
        padding: const EdgeInsets.all(16.0),
        child: SingleChildScrollView(
          physics: BouncingScrollPhysics(),
          child: Column(
            children: [
              Text(
                "मिति २०७५/०६/२८ मा स्थापित यस राष्ट्रिय परिचयपत्र तथा पञ्जिकरण विभागले पहिलो कानुनी अधिकार स्थापना गर्ने “व्यक्तिगत घटनादर्ता” कार्य साथै नेपाल सरकारका अत्यन्त लोकप्रिय दुई ठूला कार्यक्रमहरु; सामाजिक सुरक्षाअन्तर्गत “नगद प्रवाह” र व्यक्तिहरुको डिजिटल पहिचान (Digital Identity) स्थापना गर्ने बहुउपयोगी “राष्ट्रिय परिचयपत्र” वितरण कार्यको जिम्मेवारी सम्हाल्दै आएको छ । देशका नागरिकहरुको पहिचान र हितमा सञ्चालित यी तिनै कार्यक्रमहरु कुनै न कुनै रुपमा अन्तरसम्बन्धित  छन् र हाल प्रविधिमा पनि आधारित छन् । यसकारण विभिन्न समयमा लागू भई आ–आफ्नै किसिमले सञ्चालन भईआएका तिन कार्यक्रमहरु विभिन्न समयमा कार्यालयहरु एकीकरण हुने कार्य भई हाल बृहत क्षेत्र ओगटेको प्रविधिमा आधारित विभागको रुपमा सञ्चालित छ । \n \n"
                    "राज्यमा बसोबास गर्ने प्रत्येक व्यक्तिका महत्वपूर्ण व्यक्तिगत घटनाहरुलाई आधिकारिक रुपमा रेकर्ड राख्नुलाई व्यक्तिगत घटनादर्ता भनिन्छ । सबैजसो देशहरुले घटनादर्ताको सर्वमान्य सिद्धान्तअनुसार यसलाई स्थायी, अविच्छिन्न तथा अनिवार्य कार्यको रुपमा निरन्तरता दिइरहेका हुन्छन् । यद्यपी कस्ता कार्यलाई घटना मान्ने भन्ने विषयमा देशको आवश्यक्ताअनुसार फरक पर्ने सन्दर्भमा हाम्रो देशमा भने जन्म, मृत्यु, विवाह, बसाईंसराई र सम्बन्धविच्छेद गरी पाँच किसिमका घटनाहरुलाई लिइन्छ । यसअन्तर्गत सम्बन्धित कार्यालयहरुले रेकर्ड राख्ने, भण्डारण गर्ने, उपयोग तथा वितरणसम्बन्धी कार्यहरु गर्दछन् । \n \n"
                    "विश्वव्यापीकरण तिव्र रुपमा भैरहेको आजको युगमा व्यक्तिगत घटनाले सम्बन्धित देशमा मात्र नभई अन्तराष्ट्रिय रुपमा समेत प्रभाव पारेको छ । त्यसैले घटना दर्ता अन्तराष्ट्रियस्तरमा महत्व पाएको विषय पनि हो । UNESCAP सँग नेपालले गरेको प्रतिबद्धताअनुसार सन् २०२४ सम्म सम्पूर्ण नेपाली नागरिकहरुको जन्मदर्ता शतप्रतिशत पुर्‍याउनु पर्ने र अन्य व्यक्तिगत घटनादर्तामा समेत उल्लेख्य बृद्धि गर्नुपर्ने भएकोले सोहि लक्ष्य हासिल गर्नेतर्फ विभाग क्रियाशील छ । घटनादर्ता कार्यक्रम विभागको सक्रियतामा स्थानीय तहहरुमार्फत MIS Online मा आधारित गर्ने कार्यक्रम विस्तारित छ जसले चालिस प्रतिशतभन्दा बढी जनसंख्या ओगटेको छ । हाल राष्ट्रिय परिचयपत्र तथा पञ्जीकरण ऐन, २०७६ को साथसाथै राष्ट्रिय परिचयपत्र तथा पञ्जीकरण नियमावली, २०७७ कार्यान्वयनमा छ ।"


              ),

            ],
          ),
        ),
      ),
    );
  }
}
